Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_and_disability/working_with_a_disability.html.txt.tmx
Source language: en
Languages: ga

source: Working with a disability
ga: Ag obair faoi mhíchumas

source: • Further information about employment and disability
ga: • Tuilleadh faisnéise faoi fhostaíocht agus faoi mhíchumas

source: Like all employees, people with disabilities can bring a range of skills, talents and abilities to the workplace and there is a range of supports to help them find and keep employment
ga: Ar nós gach fostaí eile, is féidir le daoine faoi mhíchumas raon scileanna, buanna agus cumas a thabhairt chuig an láthair oibre agus tá raon tacaíochtaí ar fáil dóibh le cabhrú leo fostaíocht a fháil agus a choimeád

source: Some of these are for people with disabilities who are working – see ‘Employees with disabilities’ below
ga: Tá roinnt díobh seo do dhaoine faoi mhíchumas atá ag obair – féach ‘Fostaithe faoi mhíchumas’ thíos

source: Other supports are for people with disabilities who are unemployed – see ‘Looking for work’ below
ga: Tá tacaíochtaí eile ar fáil do dhaoine faoi mhíchumas atá dífhostaithe – féach ‘Post a lorg’ thíos

source: If you develop a disability
ga: Má thagann míchumas ort

source: If you have a job and become disabled – for example, through an accident or illness – you may want to return to work at some time
ga: Má tá post agat agus go dtagann míchumas ort – mar shampla, trí thimpiste nó bhreoiteacht – d’fhéadfadh go dteastódh uait filleadh ar an obair uair éigin

source: In this situation, it is important to sit down with your employer and discuss openly your options
ga: Sa chás seo, tá sé tábhachtach suí síos le d’fhostóir agus do roghanna a plé go muiníneach

source: Depending on the nature of your disability and the type of job you have, there may be no problem with you returning to work
ga: Ag brath ar an gcineál míchumais agus ar an gcineál poist atá agat, seans nach mbeadh fadhb ar bith agat filleadh ar an obair

source: In fact, your disability may have no impact on the type of job you have or your ability to perform it
ga: Go deimhin, tá seans nach mbeadh tionchar ar bith ag do mhíchumas ar an gcineál poist atá agat nó ar do chumas é a chomhlíonadh

source: However, your disability may require that your workplace be adapted or you may need special equipment in order to perform your job
ga: D’fhéadfadh gá a bheith ann an láthair oibre a chur in oiriúint do do mhíchumas áfach nó d’fhéadfadh trealamh speisialta a bheith ag teastáil uait chun do phost a chomhlíonadh

source: If your disability prevents you from returning to your previous job, there is a range of options available – see ‘Looking for work’ below
ga: Mura féidir leat filleadh ar an bpost a bhí agat cheana de bharr do mhíchumais, tá raon roghanna ar fáil – féach ‘Post a lorg’ thíos

source: If you become more disabled or need further support
ga: Má éiríonn do mhíchumas níos measa nó má tá tuilleadh tacaíochta de dhíth ort

source: In situations where you already have a disability that has altered or is progressive, you should also sit down with your employer and discuss your available options and needs
ga: I gcásanna ina raibh míchumas agat cheana féin a d’athraigh nó atá forásach, ba chóir duit suí síos le d’fhostóir agus labhairt faoi na roghanna atá ar fáil duit agus na riachtanais atá agat

source: Some of the issues you might discuss may involve whether or not your existing job requires further adaptation, whether alterations are required to the premises and whether your working conditions and work practices will need to change
ga: D’fhéadfadh cibé an bhfuil tuilleadh athruithe ag teastáil chun do phost reatha a dhéanamh nó nach bhfuil, cibé ar gá athruithe a dhéanamh don áitreabh agus cibé ar gá d’imthosca oibre agus do chleachtais oibre a athrú a bheith i measc na saincheisteanna a bheadh á bplé agaibh

source: You should also be frank and realistic about your own ability to continue to work
ga: Ba chóir duit a bheith macánta agus réadúil faoi do chumas féin leanúint leis an obair

source: The onset or progression of a disability can be a devastating event
ga: D’fhéadfadh tosú nó dul chun cinn míchumais a bheith ina imeacht millteach

source: However, it does not always mean that you will have to give up your job
ga: Ní chiallaíonn sé i gcónaí go mbeidh ort éirí as do phost áfach

source: Employers are obliged to make reasonable accommodations for staff with disabilities and often, you can continue working in an adapted workplace or with equipment and changes to your work practice and conditions of employment
ga: Tá sé de dhualgas ar fhostóirí freastal go réasúnta do bhaill foirne faoi mhíchumas agus go minic, is féidir leat leanúint ag obair i láthair oibre oiriúnaithe nó le trealamh agus athruithe do do chleachtas oibre agus do do choinníollacha fostaíochta

source: Some possible options for you and your employer include:
ga: I measc na roghanna féideartha duitse agus do d’fhostóir tá:

source: • Partial re-deployment which allows you to continue to do part of your original job (either part-time or with the addition of new tasks)
ga: • Ath-imlonnú i bpáirt a chuireann ar do chumas leanúint le cuid den phost a bhí agat cheana féin a dhéanamh (ar bhonn páirtaimseartha nó trí thascanna nua a chur san áireamh)

source: You can drop certain tasks and take on others that are currently carried out by other colleagues
ga: Is féidir leat tascanna áirithe a thabhairt suas agus cinn eile a dhéanamh ina n-ionad atá á ndéanamh ag do chomhghleacaithe faoi láthair

source: • Re-deployment: If you are unable to perform your previous job, but could carry out another function within the organisation, re-training and re-deployment are options you and your employer can consider
ga: • Ath-imlonnú: Mura féidir leat an post a bhí agat roimhe seo a chomhlíonadh a thuilleadh, ach más féidir leat feidhm eile a chomhlíonadh laistigh den eagraíocht, is roghanna iad athoiliúint agus ath-imlonnú féidir leat agus le d’fhostóir féachaint orthu

source: • Flexible working arrangements: If you have a disability, being able to work part-time, flexitime, job share or work from home may be a deciding factor in whether you can resume your working life
ga: • Socruithe oibre solúbtha: Má tá míchumas ort, d’fhéadfadh sé a bheith ina fhachtóir cinniúna faoi cibé an féidir leat filleadh ar do shaol oibre má tá tú in ann oibriú go páirtaimseartha, oibriú ar fhleisc-am, do phost a roinnt nó oibriú ón mbaile

source: • Adapting the workplace and assistive technology: an accessible workplace and assistive technology can allow you to perform your job without difficulty
ga: • An láthair oibre a chur in oiriúint agus teicneolaíocht oiriúnaitheach: d’fhéadfadh láthair oibre inrochtana agus teicneolaíocht oiriúnaitheach cur ar do chumas do phost a chomhlíonadh gan deacracht

source: The Workplace/Equipment Adaptation Grant provides funding towards the costs of modifications or special equipment that will allow a disabled person to take up an offer of employment or to remain in employment
ga: Soláthraíonn Deontas Oiriúnaithe Trealaimh/Láithreach Oibre maoiniú le haghaidh costas na mionathruithe nó an tsaintrealaimh a ligfidh do dhuine faoi mhíchumas tairiscint fostaíochta a ghlacadh nó fanacht i bhfostaíocht

source: • Personal Reader Grant: If you are blind or visually impaired and you need help with job-related reading, you may be entitled to a grant to allow you to employ a personal reader
ga: • Deontas do Léitheoir Pearsanta: Má tá tú dall nó lagamhairc agus go bhfuil cabhair ag teastáil uait le léitheoireacht a bhaineann le do phost, d’fhéadfá a bheith i dteideal deontas chun ligean duit léitheoir pearsanta a fhostú a fháil

source: Finding and keeping capable, experienced staff that you can rely on is important to all employers
ga: Tá sé tábhachtach do gach fostóir baill foirne inniúla, a bhfuil taithí acu, agus gur féidir leo brath orthu, a fháil agus a choimeád

source: There are a number of support schemes available to you if a member of your staff acquires a disability or if you hire a new staff member who has a disability
ga: Tá roinnt scéimeanna tacaíochta ar fáil duit má thagann míchumas ar dhuine de do bhaill fhoirne nó má fhostaíonn tú ball foirne nua a bhfuil míchumas air/uirthi

source: These employment supports are provided by the Department of Social Protection
ga: Soláthraíonn an Roinn Coimirce Sóisialaí na tacaíochtaí fhostaíochta seo

source: • Workplace/Equipment Adaptation Scheme: If you have to make changes, you may be able to get this grant towards the costs of adapting your premises or buying equipment
ga: • Scéim OiriúnaithTrealaimh/Láithreach Oibre: Má bhíonn ort athruithe a dhéanamh, d’fhéadfadh go mbeifeá in ann an deontas seo a fháil ó FÁS i dtreo na gcostas a bhaineann le d’áitreabh a chur in oiriúint nó chun trealamh a cheannach

source: • The Employee Retention Grant Scheme can help you to retain an employee who has acquired an illness, condition or impairment that affects their ability to carry out their job
ga: • D’fhéadfadh an Scéim Deontais um Fhostaí a Choinneáil cabhrú leat fostaí a choinneáil a bhfuil breoiteacht, riocht nó laige tagtha air a chuireann isteach ar a chumas a phost a chomhlíonadh

source: • The Disability Awareness Training Scheme is open to all companies in the private sector
ga: • Tá an Scéim Oiliúnaum Fheasacht ar Mhíchumas oscailte do na cuideachtaí go léir san earnáil phríobháideach

source: Disability awareness training can help your staff provide the best service to customers or clients with disabilities and ensures that they also develop and maintain good working relationships with colleagues with disabilities
ga: D’fhéadfadh oiliúint feasachta míchumais cabhrú le d’fhoireann an tseirbhís is fearr a sholáthar do chustaiméirí nó chliaint a bhfuil míchumas orthu agus cinntíonn sé go bhforbraíonn agus go gcoimeádann siad caidreamh oibre maith le comhghleacaithe a bhfuil míchumas orthu

source: • The Wage Subsidy Scheme provides financial incentives to employers, outside the public sector, to employ certain people with disabilities who work between 21 and 39 hours per week
ga: • Cuireann an Scéim Fóirdheontais Pá dreasachtaí airgeadais ar fáil d’fhostóirí, lasmuigh den earnáil phoiblí, chun daoine áirithe faoi mhíchumas a fhostú a oibríonn níos mó ná 20 uair in aghaidh na seachtaine

source: The Employers' Disability Information Service is for employers on employing staff with disabilities
ga: Tá an tSeirbhís Fhaisnéise Míchumais d’Fhostóirí ann d’fhostóirí maidir le foireann atá faoi mhíchumas a fhostú

source: Its information and advice is available through the telephone helpline on (01) 676 2014 and the website, employerdisabilityinfo.ie
ga: Tá faisnéis agus comhairle le fáil tríd an líne chabhrach guthán ar (01) 676 2014 agus an suíomh gréasáin, employerdisabilityinfo.ie

source: Employment rights of people with disabilities
ga: Cearta fostaíochta daoine faoi mhíchumas

source: Employees with disabilities have the same employment rights as other employees
ga: Tá na cearta fostaíochta céanna ag fostaithe faoi mhíchumas is atá ag fostaithe eile

source: Equality legislation: The Employment Equality Acts 1998-2015 outlaw discrimination on the grounds of disability in employment, including training and recruitment
ga: Reachtaíocht comhionannais: Cuireann na hAchtanna um Chomhionannas Fostaíochta 1998-2015 cosc iomlán ar idirdhealú ar fhoras míchumais i bhfostaíocht, oiliúint agus earcú san áireamh

source: However the Employment Equality Acts state that an employer is not obliged to recruit or retain a person who is not fully competent or capable of undertaking the duties attached to a job
ga: Deir na hAchtanna um Chomhionannas Fostaíochta áfach nach bhfuil sé de dhualgas ar fhostóir duine a earcú ná a choinneáil nach bhfuil iomlán inniúil nó nach bhfuil ábalta na dualgais a bhaineann leis an bpost a chomhlíonadh

source: If you have a mental health difficulty there are 2 booklets, Equality and mental health: what the law means for your workplace and Equality and mental health: how the law can help you
ga: Má tá deacracht sláinte meabhrach agat, tá 2 leabhrán, Equality and mental health: what the law means for your workplace agus Equality and mental health: how the law can help you

source: Reasonable accommodation: The Employment Equality Acts 1998-2015 require employers to take reasonable steps to accommodate the needs of employees and prospective employees with disabilities
ga: Freastal réasúnta: De réir na nAchtanna um Chomhionannas Fostaíochta 1998-2015 tá ar fhostóirí céimeanna réasúnta a ghlacadh chun freastal ar riachtanais fostaithe agus fostaithe féideartha a bhfuil míchumais orthu

source: Reasonable accommodation can be defined as some modification to the tasks or structure of a job or workplace, which allows the qualified employee with a disability to fully do the job and enjoy equal employment opportunities
ga: Is féidir freastal réasúnta a shainmhíniú mar oiriúnú áirithe a dhéanamh ar na tascanna nó ar struchtúr an phoist nó na láithreach oibre, a ligeann don fhostaí cáilithe atá faoi mhíchumas a phost a chomhlíonadh go hiomlán agus tairbhe a bhaint as comhdheiseanna fostaíochta

source: However, under EU legislation, employers are not obliged to provide special treatment or facilities if the cost of doing so is excessive or disproportionate
ga: Faoi reachtaíocht an AE áfach, níl dualgas ar fhostóirí caitheamh go speisialta le fostaithe ná áiseanna speisialta a sholáthar dóibh má tá costas iomarcach nó díréireach ag baint lena leithéid a dhéanamh

source: Health and safety: Under the Safety, Health and Welfare at Work Act 2005 employers must ensure the safety, health and welfare of all employees in their workplace
ga: Sláinte agus sábháilteacht: Faoin Acht um Shábháilteacht, Sláinte agus Leas ag an Obair 2005 ní mór d’fhostóirí sábháilteacht, sláinte agus leas na bhfostaithe go léir ina láthair oibre a chinntiú

source: Special mention is made of employees with disabilities and employers are directed to take their needs into account, particularly with regard to doors, passageways, staircases, showers, washbasins, lavatories and workstations
ga: Tugtar aird ar leith ar fhostaithe faoi mhíchumais agus treoraítear d’fhostóirí a gcuid riachtanas a thabhairt san áireamh, go háirithe maidir le doirse, pasáistí, staighrí, cithfholcadáin, báisíní níocháin, leithris agus stáisiúin oibre

source: Public service quota: The Disability Act 2005 places an obligation on public bodies to consider and respond to the needs of people with disabilities
ga: Cuóta na seirbhíse poiblí: Cuireann an tAcht um Míchumas 2005 dualgas ar chomhlachtaí poiblí breathnú ar riachtanais daoine faoi mhíchumas agus freastal orthu

source: Under Part 5 of the Act, 3% of jobs in public service bodies (local authorities, civil service, the Health Service Executive and so on) are reserved for people with disabilities
ga: Faoi Chuid 5 den Acht, coimeádtar 3% de na poist i gcomhlachtaí seirbhíse poiblí (údaráis áitiúla, an státseirbhís, FSS agus araile) do dhaoine faoi mhíchumas

source: Whether you are looking for a job for the first time or re-entering the work force after an absence, it is important that you take stock of your skills and the practicalities associated with both your disability and the kind of work for which you are applying
ga: Cibé an bhfuil tú ag lorg poist den chéad uair nó go bhfuil tú ag filleadh ar an obair tar éis bheith as láthair, tá sé tábhachtach go dtugann tú do chuid scileanna faoi deara mar aon leis na praiticiúlachtaí a bhaineann le do mhíchumas agus leis an gcineál oibre a bhfuil iarratas á chur isteach agat uirthi araon

source: A lot of employers have equal opportunities policies in place and make it clear on job applications that they welcome applications from suitably qualified people with disabilities
ga: Tá beartais chomhdheiseanna ar bun ag a lán fostóirí agus léiríonn siad go soiléir ar fhógraí le haghaidh poist go gcuireann siad fáilte roimh iarratais ó dhaoine faoi mhíchumas a bhfuil na cáilíochtaí oiriúnacha acu

source: However, you should be aware of your rights and the obligations potential employers have towards you under equality legislation
ga: Ba chóir go mbeifeá ar an eolas áfach faoi na cearta atá agat agus faoi na dualgais atá ar fhostóirí féideartha maidir leat faoi reachtaíocht comhionannais

source: It is up to you to decide whether to disclose your disability to potential employers
ga: Tá sé suas chugat féin an cinneadh a dhéanamh cibé an dteastaíonn uait insint d’fhostóirí féideartha faoi do mhíchumas

source: This is particularly so if your disability is not obvious (such as a chronic illness like arthritis or a mental illness) but may keep you from performing certain duties
ga: Baineann sé seo go háirithe mura bhfuil do mhíchumas sofheicthe (mar shampla tinneas ainsealach ar nós airtríteas nó meabhairghalair) ach go bhféadfadh sé bac a chur ort dualgais áirithe a chomhlíonadh

source: While you may have your reasons for keeping your disability private, your employer cannot accommodate any special needs you may have if they do not know about your condition
ga: Cé go bhféadfadh do chúiseanna féin a bheith agat le do mhíchumas a choimeád príobháideach, ní féidir le d’fhostóir freastal ar aon riachtanais speisialta a d’fhéadfadh a bheith agat mura bhfuil a fhios acu faoi do mhíchumas

source: There are a number of support schemes and training opportunities available to people with disabilities who want to enter the work force
ga: Tá roinnt scéimeanna tacaíochta agus deiseanna oiliúna ar fáil do dhaoine faoi mhíchumas má theastaíonn uathu dul isteach san fhórsa oibre

source: Labour market services for people with disabilities include helping them find paid employment or preparing them for work through training or employment programmes
ga: Cuimsíonn seirbhísí margadh saothair do dhaoine faoi mhíchumas cabhrú leo fostaíocht le pá a fháil nó iad a ullmhú don obair trí chláir oiliúna nó fostaíochta

source: Employment supports are provided by the Department of Social Protection
ga: Soláthraíonn an Roinn Coimirce Sóisialaí na tacaíochtaí fhostaíochta seo

source: There is training for the unemployed and for people who are re-entering the workforce through specific skills training and traineeships
ga: Tá oiliúint do dhaoine dífhostaithe agus do dhaoine atá ag filleadh ar an bhfórsa oibre trí oiliúint agus chúrsaí oiliúna um scileanna speisialta

source: Training for people in employment is offered through apprenticeships and in-company training
ga: Tairgtear oiliúint do dhaoine i bhfostaíocht trí phrintíseachtaí agus oiliúint inmheánach

source: People with disabilities are encouraged to make use of all these training options
ga: Spreagtar daoine faoi mhíchumas leas a bhaint as na roghanna oiliúna seo go léir

source: Training courses for people with disabilities who may need more intensive support than would be available in non-specialist training courses are delivered by specialist training providers
ga: Tugann soláthraí sainoiliúna cúrsaí oiliúna a sholáthar do dhaoine faoi mhíchumas, a d’fhéadfadh tacaíocht níos déine a bheith de dhíth orthu ná mar a mbeadh ar fáil i ngnáthchúrsaí oiliúna

source: Some key features of specialist training include adapted equipment, a more individual approach and longer training sessions
ga: San áireamh ar phríomhghnéithe na sainoiliúna tá trealamh oiriúnaithe, cur chuige atá dírithe níos mó ar an duine aonair agus seisiúin oiliúna níos faide

source: Job Interview Interpreter Grant Scheme
ga: Scéim Deontais um Ateangaire le haghaidh Agallamh Poist

source: If you are a jobseeker who is deaf, hard of hearing or has a speech impairment you can apply for funding to have a sign language interpreter or other interpreter attend a job interview with you
ga: Má tá tú i d’iarrthóir poist atá bodhar, nó go bhfuil moill éisteachta nó máchail chainte ort is féidir leat iarratas a chur chuig FÁS ar mhaoiniú le go rachadh ateangaire sa teanga chomharthaíochta nó ateangaire eile chuig d’agallamh poist in éineacht leat

source: Funding can also be provided to cover the costs of an interpreter during an induction period when you start work
ga: Is féidir maoiniú a sholáthar freisin chun costais an ateangaire a chlúdach le linn tréimhse insealbhaithe nuair a thosaíonn tú ag an obair

source: The EmployAbility Service helps people with disabilities find work and offers them ongoing support, including job coaches throughout their employment
ga: Cabhraíonn an tSeirbhís EmployAbility le daoine faoi mhíchumas obair a fháil agus cuireann sé tacaíocht leanúnach ar fáil dóibh, lena n-áirítear oiliúnóirí poist ar feadh a bhfostaíochta

source: The programme operates through a range of organisations around the country
ga: Oibríonn an clár trí raon eagraíochtaí ar fud na tíre

source: Disability payments and work
ga: Íocaíochtaí míchumais agus an obair

source: If you are getting certain disability payments, for example, Disability Allowance and Blind Pension, you may be allowed to do some work that is rehabilitative or therapeutic - with permission from the Department of Social Protection - see ‘Employment schemes’ below
ga: Má tá íocaíocht míchumais á fháil agat, mar shampla, Liúntas Míchumais agus Pinsean na nDall, d’fhéadfaí ligean duit roinnt oibre a dhéanamh atá ina hobair athshlánúcháin nó theiripeach le cead ón Roinn Coimirice Sóisialaí

source: If you are getting Illness Benefit or Invalidity Pension and you wish to return to work you may qualify for Partial Capacity Benefit
ga: Ó 13 Feabhra 2012 má fhaigheann tú Sochar Breoiteachta nó Pinsean Easláinte, d’fhéadfá cáiliú don Sochar Chumais Pháirtigh

source: • The Community Employment scheme helps the long-term unemployed and people with disabilities (among others) to get back to work
ga: • Cabhraíonn an Scéim Fostaíochta Pobail le daoine atá dífhostaithe go fadtéarmach agus le daoine faoi mhíchumas (i measc eile) filleadh ar an obair

source: • The Community Services Programme aims to address disadvantage by supporting local community activity and providing local employment opportunities for certain groups of people, including people with disabilities
ga: • Tá sé d’aidhm ag an gClár Seirbhísí Pobail plé le míbhuntáiste trí thacú le gníomhaíocht phobail áitiúil agus trí dheiseanna fostaíochta áitiúla a sholáthar do ghrúpaí áirithe daoine, daoine faoi mhíchumas san áireamh

source: • The Rural Social Scheme provides income support for farmers and fishermen who are receiving long-term social welfare payments such as disability payments
ga: • Soláthraíonn Scéim Shóisialta na Tuaithe tacaíocht ioncaim d’fheirmeoirí agus iascairí a fhaigheann íocaíochtaí leasa shóisialaigh fadtéarmacha ar nós íocaíochtaí míchumais

source: • JobBridge, the National Internship Scheme provides work experience opportunities for people getting certain social welfare payments including Disability Allowance
ga: • Soláthraíonn JobBridge Scéim Náisiúnta Intéirneachta deiseanna thaithí oibre do dhaoine a bhí ag fáil íocaíochtaí leasa shóisialaigh áirithe, Liúntas Míchumais san áireamh

source: People with disabilities who want to start their own business may be eligible for the Back to Work Enterprise Allowance which encourages unemployed people, lone parents and people getting Disability Allowance or Blind Person's Pension to take up self-employment
ga: D’fhéadfadh daoine faoi mhíchumas a theastaíonn uathu a ngnó féin a thosú a bheith incháilithe le haghaidh an Liúntas Fiontraíochta um Fhilleadh ar Obair spreagadh do dhaoine dífhostaithe, do thuismitheoirí aonair agus do dhaoine atá ag fáil Liúntais Mhíchumais nó Pinsean na nDall dul i mbun féinfhostaíochta

source: Further information about employment and disability
ga: Tuilleadh faisnéise faoi fhostaíocht agus faoi mhíchumas
